<%@ Page Title="" Language="C#" MasterPageFile="~/Default.Master" AutoEventWireup="true" CodeBehind="Default.aspx.cs" Inherits="OIDReg.Default1" %>

<%@ Register Src="~/Sidebar1.ascx" TagPrefix="uc1" TagName="Sidebar1" %>

<asp:Content ID="Content1" ContentPlaceHolderID="head" runat="server">
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolder1" runat="server">
    

		<div id="main">
				
			<a name="TemplateInfo"></a>
			<h2><a href="default.aspx" title="">ข้อเสนอแนะเกี่ยวกับมาตรฐานด้านเทคโนโลยีสารสนเทศและการสื่อสารที่จาเป็นต่อธุรกรรมทางอิเล็กทรอนิกส์</a></h2>
					
			<p class="post-info">Posted by <a href="#">สานักงานพัฒนาธุรกรรมทางอิเล็กทรอนิกส์</a> | Filed under <a href="index.html">มาตรฐาน</a>, <a href="index.html">internet</a></p>
				
         <p>
             ในกระบวนการทางด้านเทคโนโลยีสารสนเทศและการทาธุรกรรมทางอิเล็กทรอนิกส์ จาเป็นที่จะต้องมีการติดต่อสื่อสารและแลกเปลี่ยนข้อมูลระหว่างเครื่องคอมพิวเตอร์หรืออุปกรณ์ต่าง ๆ 
             แต่เนื่องจากข้อมูลหรือแอพพลิเคชั่นต่าง ๆ มีความหลากหลาย ไม่ว่าจะเป็นการถูกพัฒนาขึ้นโดยคนละบริษัท มีการใช้โพรโทคอลและอัลกอริทึมที่ต่างชนิดหรือต่างเวอร์ชั่น 
             หรือมีการนาข้อมูลมาประยุกต์ใช้งานที่แตกต่างกัน ส่งผลให้แอพพลิเคชั่นไม่สามารถทางานร่วมกันได้ หรือทาให้การแลกเปลี่ยนข้อมูลและประมวลผลข้อมูลของเครื่องคอมพิวเตอร์หรืออุปกรณ์ที่เกี่ยวข้องมีความผิดพลาด 
             และเพื่อให้มีการระบุวัตถุ (Object) ที่เกี่ยวข้องกับการสื่อสารแลกเปลี่ยนข้อมูลและการประมวลผลข้อมูลมีความเป็นเอกลักษณ์ และทาให้อุปกรณ์หรือแอพพลิเคชั่นสามารถอ้างอิงวัตถุดังกล่าวด้วยวิธีการที่ใช้ในการระบุแบบเดียวกัน 
             สหภาพโทรคมนาคมระหว่างประเทศ ภาคการกาหนดมาตรฐานโทรคมนาคม (International Telecommunication Union, Telecommunication Standardi-zation Sector: ITU-T) 
             และคณะกรรมการวิชาการร่วมขององค์กรระหว่างประเทศว่าด้วยการมาตรฐาน (International Organization for Standardization: ISO) 
             และคณะกรรมาธิการระหว่างประเทศว่าด้วยการมาตรฐานสาขาอิเล็กทรอนิกส์ (International Electrotechnical Commission: IEC) ได้ร่วมกันพัฒนา ตัวระบุวัตถุ (Object Identifier: OID) 
             ขึ้นเพื่อใช้ในการระบุวัตถุทุกอย่างด้วยชื่อที่เป็นเอกลักษณ์ในระดับสากล (globally unambiguous name) และเป็นชื่อเรียกถาวร (persistent name) ของวัตถุนั้นโดยจะไม่มีการนาชื่อหรือตัวระบุวัตถุมาใช้ซ้าอีก
         </p>

         <p>
            สานักงานพัฒนาธุรกรรมทางอิเล็กทรอนิกส์ (องค์การมหาชน) หรือ สพธอ. ได้เล็งเห็นถึงความสาคัญของ ตัวระบุวัตถุ (OID) 
             ซึ่งมีการนามาใช้ระบุวัตถุที่เป็นองค์ประกอบของใบรับรองอิเล็กทรอนิกส์ (Digital Certificate) ข้อความที่ใช้ในการแลกเปลี่ยนข้อมูล 
             รหัสอ้างอิง และวัตถุด้านสารสนเทศอื่น ๆ ที่ถูกกาหนดตามมาตรฐานที่เกี่ยวกับการทาธุรกรรมทางอิเล็กทรอนิกส์ 
             ว่ามีความสาคัญและเป็นโครงสร้างพื้นฐานด้านมาตรฐานที่สาคัญสาหรับใช้ในการระบุวัตถุต่าง ๆ เพื่อให้มีการอ้างอิงด้วยชื่อที่เป็นเอกลักษณ์ในระดับสากล 
             ซึ่งจะส่งผลให้การแลกเปลี่ยนข้อมูลและประมวลผลข้อมูลของเครื่องคอมพิวเตอร์หรืออุปกรณ์ที่เกี่ยวข้องสามารถอ้างอิงวัตถุต่าง ๆ ด้วยตัวระบุวัตถุเดียวกัน 
             และเป็นมาตรฐาน ด้วยเหตุนี้ สพธอ. จึงได้จัดทาหลักเกณฑ์และขั้นตอนการลงทะเบียนสาหรับโครงสร้างหมายเลขโอไอดีของสานักงานพัฒนาธุรกรรมทางอิเล็กทรอนิกส์ (องค์การมหาชน) 
             เพื่อใช้เป็นแนวทางทาให้เกิดการเชื่อมโยงและแลกเปลี่ยนข้อมูลสารสนเทศระหว่างหน่วยงานต่าง ๆ ต่อไป
			</p>
				
			<p class="post-footer">		
			<a href="#" class="readmore">Read more</a> |
			<a href="#" class="comments">Comments (3)</a> |				
			<span class="date">July 20, 2008</span>
			
			</p>
			
			<h2><a href="index.html">คำนิยาม</a></h2>
			
			<h3>ศัพท์ทางเทคนิค</h3>
			<div>
                <table border="1" cellspacing="0">
                    <tr style="vertical-align:top">
                        <td width="30%">วัตถุ<br />(Object)</td>
                        <td>สิ่งที่เกี่ยวกับการสื่อสารโทรคมนาคมและการประมวลผลข้อมูลสารสนเทศ โดยสิ่งนั้นสามารถถูกระบุได้ด้วยชื่อและสามารถนำไปลงทะเบียนได้ [1] </td>
                    </tr>
                    <tr style="vertical-align:top">
                        <td>ตัวระบุวัตถุ<br /> (Object Identifier หรือ OID)</td>
                        <td>รายการลำดับของตัวเลขจำนวนเต็มซึ่งใช้ระบุวัตถุ หรืออาจจะเรียกว่าหมายเลขโอไอดี [1]</td>
                    </tr>
                    <tr style="vertical-align:top">
                        <td>ค่าจำนวนเต็มปฐมภูมิ<br />(Primary integer value)</td>
                        <td>เลขจำนวนเต็มที่ใช้เป็นค่าปฐมภูมิสำหรับใช้เป็นตัวระบุวัตถุ [1]</td>
                    </tr>
                    <tr style="vertical-align:top">
                        <td>ตัวระบุวัตถุแบบทุติยภูมิ<br />(Secondary identifier) </td>
                        <td>ตัวระบุวัตถุซึ่งเป็นค่าที่ประกอบด้วยตัวเลข ตัวอักษรภาษาอังกฤษ และเครื่องหมายยัติภังค์ (-) ซึ่งเป็นค่าที่มนุษย์อ่านเข้าใจ โดยตัวอักษรที่ใช้ขึ้นต้นต้องเป็นภาษาอังกฤษตัวพิมพ์เล็ก และต้องไม่ใช้เครื่องหมายยัติภังค์ลงท้ายและไม่ใช้เครื่องหมายยัติภังค์ติดกันสองตัว</td>
                    </tr>
                    <tr style="vertical-align:top">
                        <td>ป้ายชื่อยูนิโคดแบบจานวนเต็ม<br />(Integer-valued Unicode label)</td>
                        <td>ป้ายชื่อที่ใช้การเข้ารหัสอักขระแบบยูนิโคด (Unicode) ซึ่งเป็นจานวนเต็ม (จะไม่ใช้เลขศูนย์นาหน้ายกเว้นจะใช้เพียงแค่เลขศูนย์เพียงตัวเดียวเท่านั้น) สาหรับตัวระบุวัตถุซึ่งจะมีค่าเหมือนกับค่าจานวนเต็มปฐมภูมิ ทั้งนี้ป้ายชื่อแบบยูนิโคดต้องไม่ประกอบด้วยตัวอักขระว่าง (Space character) [1]</td>
                    </tr>
                    <tr style="vertical-align:top">
                        <td>ป้ายชื่อยูนิโคดแบบที่ไม่ใช่จานวนเต็ม<br />(Non-integer Unicode label)</td>
                        <td>ป้ายชื่อที่ใช้การเข้ารหัสอักขระแบบยูนิโคด (Unicode) ซึ่งสามารถใช้อักษรภาษาอังกฤษหรือภาษาไทยหรือภาษาอื่น ๆ รวมถึงตัวเลขและอักขระพิเศษอื่น ๆ โดยป้ายชื่อดังกล่าวสามารถนามาใช้ซ้าได้ ทั้งนี้ป้ายชื่อแบบยูนิโคดจะต้องไม่ประกอบด้วยตัวอักษรว่าง (Space character) [1]</td>
                    </tr>
                </table>				
			</div>
				

		<!-- main ends -->	
		</div>
				
    <uc1:Sidebar1 runat="server" id="Sidebar1" />


</asp:Content>
